/**
 * @description 品质条与HQ率的关系
 * 数据来源：[6.x][制造][采集]制造采集相关机制数据分享/探讨(https://bbs.nga.cn/read.php?tid=31075581&page=1&rand=292)
 */

const progressToHQPercentage: { [key: number]: string } = {
    0: '1%',
    0.05: '2%',
    0.09: '3%',
    0.13: '4%',
    0.17: '5%',
    0.21: '6%',
    0.25: '7%',
    0.29: '8%',
    0.32: '9%',
    0.35: '10%',
    0.38: '11%',
    0.41: '12%',
    0.44: '13%',
    0.47: '14%',
    0.5: '15%',
    0.53: '16%',
    0.55: '17%',
    0.58: '18%',
    0.61: '19%',
    0.63: '20%',
    0.65: '21%',
    0.66: '22%',
    0.67: '23%',
    0.68: '24%',
    0.69: '26%',
    0.7: '28%',
    0.71: '31%',
    0.72: '34%',
    0.73: '38%',
    0.74: '42%',
    0.75: '47%',
    0.76: '52%',
    0.77: '58%',
    0.78: '64%',
    0.79: '68%',
    0.8: '71%',
    0.81: '74%',
    0.82: '76%',
    0.83: '78%',
    0.84: '80%',
    0.85: '81%',
    0.86: '82%',
    0.87: '83%',
    0.88: '84%',
    0.89: '85%',
    0.9: '86%',
    0.91: '87%',
    0.92: '88%',
    0.93: '89%',
    0.94: '90%',
    0.95: '91%',
    0.96: '92%',
    0.97: '94%',
    0.98: '96%',
    0.99: '98%',
    1: '100%',
}

export function getHQPercentage (quality: number, qualityNeed: number) {
    let ratio = Math.floor(quality / qualityNeed * 100) / 100;
    while (!progressToHQPercentage[ratio]) {
      ratio = (ratio * 100 - 1) / 100;
      if (ratio < 0 || ratio > 1) {
        return 'unknown';
      }
    }
    return progressToHQPercentage[ratio];
}